In [1]:
#dependencies
#!pip install openpyxl

In [2]:
import pandas as pd
import numpy as np

## Import Data

In [3]:
#import enrollment data
enroll18 = pd.read_excel('data/Database_SchoolDetail17-18.xlsx', sheet_name = 'EnrollmentTrendsbyGrade')
enroll19 = pd.read_excel('data/Database_SchoolDetail18-19.xlsx', sheet_name = 'EnrollmentTrendsbyGrade')
enroll20 = pd.read_excel('data/Database_SchoolDetail19-20.xlsx', sheet_name = 'EnrollmentTrendsbyGrade')

In [4]:
#import test score data
tests18 = pd.read_excel('data/Database_SchoolDetail17-18.xlsx', sheet_name = 'PSAT-SAT-ACTPerformance')
tests19 = pd.read_excel('data/Database_SchoolDetail18-19.xlsx', sheet_name = 'PSAT-SAT-ACTPerformance')
tests20 = pd.read_excel('data/Database_SchoolDetail19-20.xlsx', sheet_name = 'PSAT-SAT-ACTPerformance')

In [95]:
#import graduation rates data
grad18 = pd.read_excel('data/Database_SchoolDetail17-18.xlsx', sheet_name = 'GraduationRateTrends')
grad19 = pd.read_excel('data/Database_SchoolDetail18-19.xlsx', sheet_name = 'GraduatonRateTrendsProgress')
grad20 = pd.read_excel('data/Database_SchoolDetail19-20.xlsx', sheet_name = 'GraduatonRateTrendsProgress')

In [6]:
enroll18.head(2)

,CountyCode,CountyName,DistrictCode,DistrictName,SchoolCode,SchoolName,GradePK,GradeKG,Grade01,Grade02,...,Grade04,Grade05,Grade06,Grade07,Grade08,Grade09,Grade10,Grade11,Grade12,Total
0,1,ATLANTIC,10,ABSECON CITY,50,EMMA C ATTALES,0,0,0,0,...,0,97,93,79,106,0,0,0,0,375
1,1,ATLANTIC,10,ABSECON CITY,60,H ASHTON MARSH,39,99,84,86,...,103,0,0,0,0,0,0,0,0,493

## Data cleanup

* Filter to only Essex County schools (Essex County code: 13)

* Create a column for school year
* Merge together each dataset by year
* Average over all schools in Essex County

Grad
* Rename 17-18 columns to match the other datasets

### Enrollment

In [7]:
# Filter to only Essex County schools (Essex County code: 13)
enroll18 = enroll18[enroll18.CountyCode == 13]
enroll19 = enroll19[enroll19.CountyCode == 13]
enroll20 = enroll20[enroll20.CountyCode == 13]

In [8]:
#drop countycode, countyname, districtcode, distirctname, schoolname, schoolcode
enroll18 = enroll18[['GradePK', 'GradeKG', 'Grade01', 'Grade02',
       'Grade03', 'Grade04', 'Grade05', 'Grade06', 'Grade07', 'Grade08',
       'Grade09', 'Grade10', 'Grade11', 'Grade12', 'Total']]
enroll19 = enroll19[['GradePK', 'GradeKG', 'Grade01', 'Grade02',
       'Grade03', 'Grade04', 'Grade05', 'Grade06', 'Grade07', 'Grade08',
       'Grade09', 'Grade10', 'Grade11', 'Grade12', 'Total']]
enroll20 = enroll20[['GradePK', 'GradeKG', 'Grade01', 'Grade02',
       'Grade03', 'Grade04', 'Grade05', 'Grade06', 'Grade07', 'Grade08',
       'Grade09', 'Grade10', 'Grade11', 'Grade12', 'Total']]

In [9]:
#taking the average for each grade over all schools 
enroll18 = pd.DataFrame(enroll18.mean(axis = 0))
enroll19 = pd.DataFrame(enroll19.mean(axis = 0))
enroll20 = pd.DataFrame(enroll20.mean(axis = 0))

#renaming the columns to be the corresponding years
enroll18.columns = ['2018']
enroll19.columns = ['2019']
enroll20.columns = ['2020']

In [10]:
#merge each year together
enroll_all = pd.concat([enroll18, enroll19, enroll20], axis = 1)

In [11]:
enroll_all

               2018        2019        2020
GradePK   23.543379   24.027778   24.405530
GradeKG   38.050228   38.976852   38.317972
Grade01   39.264840   40.087963   40.267281
Grade02   39.634703   40.138889   40.350230
Grade03   41.876712   40.717593   40.198157
Grade04   42.136986   42.486111   41.013825
Grade05   42.269406   42.574074   42.188940
Grade06   39.899543   42.625000   42.198157
Grade07   38.410959   40.805556   42.820276
Grade08   40.383562   39.120370   40.640553
Grade09   39.995434   41.125000   40.912442
Grade10   39.657534   39.953704   40.364055
Grade11   37.981735   39.277778   38.751152
Grade12   38.598174   38.879630   39.774194
Total    542.210046  551.041667  552.304147

In [12]:
#adding a column for year
#enroll18.loc[:, "Year"] = np.ones(len(enroll18)) * 2018
#enroll18.Year = enroll18.Year.astype(int)
#enroll19.loc[:, "Year"] = np.ones(len(enroll19)) * 2019
#enroll19.Year = enroll19.Year.astype(int)
#enroll20.loc[:, "Year"] = np.ones(len(enroll20)) * 2020
#enroll20.Year = enroll20.Year.astype(int)

### Tests

In [13]:
# Filter to only Essex County schools (Essex County code: 13)
tests18 = tests18[tests18.CountyCode == 13]
tests19 = tests19[tests19.CountyCode == 13]
tests20 = tests20[tests20.CountyCode == 13]

In [14]:
#drop countycode, countyname, districtcode, distirctname, schoolname, schoolcode, BT_PCT, STATE_BT_PCT, benchmark
tests18 = tests18[['Test', 'Subject', 'School_Avg',
       'State_avg']]
tests19 = tests19[['Test', 'Subject', 'School_Avg',
       'State_avg']]
tests20 = tests20[['Test', 'Subject', 'School_Avg',
       'State_avg']]

In [15]:
#drop bad data (School_Avg = "*" or "N")
tests18 = tests18.drop(tests18[tests18.School_Avg == '*'].index)
tests18 = tests18.drop(tests18[tests18.School_Avg == 'N'].index)

tests19 = tests19.drop(tests19[tests19.School_Avg == '*'].index)
tests19 = tests19.drop(tests19[tests19.School_Avg == 'N'].index)

tests20 = tests20.drop(tests20[tests20.School_Avg == '*'].index)
tests20 = tests20.drop(tests20[tests20.School_Avg == 'N'].index)

In [16]:
#convert school test average to type float
tests18['School_Avg'] = tests18['School_Avg'].astype(float)
tests19['School_Avg'] = tests19['School_Avg'].astype(float)
tests20['School_Avg'] = tests20['School_Avg'].astype(float)

In [17]:
#group by test, subject -  average school_avg
tests18 = tests18.groupby(['Test', 'Subject']).mean().reset_index()
tests19 = tests18.groupby(['Test', 'Subject']).mean().reset_index()
tests20 = tests18.groupby(['Test', 'Subject']).mean().reset_index()

In [18]:
#adding a column for year
tests18.loc[:, "Year"] = np.ones(len(tests18)) * 2018
tests18.Year = tests18.Year.astype(int)

tests19.loc[:, "Year"] = np.ones(len(tests19)) * 2019
tests19.Year = tests19.Year.astype(int)

tests20.loc[:, "Year"] = np.ones(len(tests20)) * 2020
tests20.Year = tests20.Year.astype(int)

In [19]:
#merge data together
tests_all = pd.concat([tests18, tests19, tests20], axis = 0)

### Graduation

In [96]:
# Filter to only Essex County schools (Essex County code: 13)
grad18 = grad18[grad18.CountyCode == 13]
grad19 = grad19[grad19.CountyCode == 13]
grad20 = grad20[grad20.CountyCode == 13]

In [97]:
grad18.columns

Index(['CountyCode', 'CountyName', 'DistrictCode', 'DistrictName',
       'SchoolCode', 'SchoolName', 'CohortYear', '4YR_Rate', '5YR_Rate'],
      dtype='object')

In [98]:
#drop CountyCode, CountyName, DistrictCode, DistrictName, SchoolCode, SchoolName
grad18 = grad18[['CohortYear', '4YR_Rate', '5YR_Rate']]

#drop 'CountyCode', 'CountyName', 'DistrictCode', 'DistrictName','SchoolCode', 'SchoolName','AnnualTarget', 'MetAnnualTarget','StatewideGraduationRate'
grad19 = grad19[['CohortYear', 'GraduationRateType', 'GraduationRate']]
grad20 = grad20[['CohortYear', 'GraduationRateType', 'GraduationRate']]

In [99]:
#replace '*' and 'N' with NULLs
grad18 = grad18.replace('*', np.NaN)
grad18 = grad18.replace('N', np.NaN)
grad19 = grad19.replace('*', np.NaN)
grad19 = grad19.replace('N', np.NaN)
grad20 = grad20.replace('*', np.NaN)
grad20 = grad20.replace('N', np.NaN)

In [100]:
#convert rates to floats
grad18['4YR_Rate'] = grad18['4YR_Rate'].astype(float)
grad18['5YR_Rate'] = grad18['5YR_Rate'].astype(float)
grad19['GraduationRate'] = grad19['GraduationRate'].astype(float)
grad20['GraduationRate'] = grad20['GraduationRate'].astype(float)

In [101]:
#aggregate and get the mean grad rate for each cohort year
grad18 = grad18.groupby(by = ['CohortYear']).mean()

In [102]:
grad18

             4YR_Rate   5YR_Rate
CohortYear
2016        86.355556  90.220588
2017        88.438235  88.540000
2018        88.082857        NaN

In [103]:
#rename columns for 2018 dataset to match new formate
grad18.columns = ['4-Year Rate', '5-Year Rate']

In [104]:
grad18.reset_index()

   CohortYear  4-Year Rate  5-Year Rate
0        2016    86.355556    90.220588
1        2017    88.438235    88.540000
2        2018    88.082857          NaN

In [105]:
#aggregate and get the mean grad rate for each cohort year
grad19 = grad19.groupby(by = ['CohortYear', 'GraduationRateType']).mean()
grad20 = grad20.groupby(by = ['CohortYear', 'GraduationRateType']).mean()

In [106]:
#reset indices
grad19 = grad19.reset_index()
grad20 = grad20.reset_index()

In [112]:
grad18

            4-Year Rate  5-Year Rate
CohortYear
2016          86.355556    90.220588
2017          88.438235    88.540000
2018          88.082857          NaN

In [108]:
#merge 2019 & 2020 data sets
grad_all = pd.concat([grad19, grad20], axis = 0)

In [126]:
#add in 2018 data
grad18_row = {'CohortYear': '2016', 'GraduationRateType': '4-Year Rate', 'GraduationRate': 86.355556}
grad_all = grad_all.append(grad18_row, ignore_index = True)

## Export Data

In [127]:
enroll_all.to_csv("enrollment.csv")

In [128]:
tests_all.to_csv("testScores.csv")

In [129]:
grad_all.to_csv("graduationRates.csv")